embarquech/cryptnox-sdk-esp32/components/secure_channel/test/test_cw_secure_channel.cpp
#include "unity.h"
#include "CW_SecureChannel.h"
#include "CW_Defs.h"
#include "CW_Utils.h"
#include "esp32_crypto_provider.h"
#include "uECC.h"
#include "esp_random.h"
#include <string.h>
#include <stdio.h>

/******************************************************************
 * 1. Size / offset constants
 ******************************************************************/

#define SC_AES_BLOCK_BYTES          (16U)
#define SC_AES_KEY_BYTES            (32U)
#define SC_EC_COORD_BYTES           (32U)
#define SC_EC_PUBKEY_BYTES          (64U)

/* Certificate layout: 'C'[1] + nonce[8] + 0x04[1] + X[32] + Y[32] = 74 bytes */
#define SC_CERT_MARKER_BYTES         (1U)
#define SC_CERT_NONCE_BYTES          (8U)
#define SC_CERT_KEY65_BYTES         (65U)
#define SC_CERT_TOTAL_BYTES         (74U)
#define SC_CERT_KEY_OFFSET          (SC_CERT_MARKER_BYTES + SC_CERT_NONCE_BYTES)

/* APDU response sizes (data + 2-byte SW) */
#define SC_SELECT_RESP_BYTES        (26U)
#define SC_GET_CERT_RESP_BYTES     (148U)
#define SC_OPEN_SC_RESP_BYTES       (34U)
#define SC_MUTUAL_AUTH_RESP_BYTES   (66U)
#define SC_SALT_BYTES               (32U)
#define SC_IV_BYTES                 (16U)
#define SC_SHA512_OUT_BYTES         (64U)

/* Secure messaging APDU layout (outgoing) */
#define SC_APDU_HEADER_LEN           (4U)
#define SC_APDU_LC_OFFSET            (4U)
#define SC_APDU_MAC_OFFSET           (5U)   /* header[4] + Lc[1] */
#define SC_APDU_MAC_BYTES           (16U)

/* Pairing data string (without NUL terminator) */
#define SC_PAIRING_DATA "Cryptnox Basic CommonPairingData"
#define SC_PAIRING_DATA_BYTES       (32U)

/* Card response used in the AES-CBC round-trip test */
#define SC_CARD_RESP_PAYLOAD_BYTES   (4U)
#define SC_CARD_RESP_TOTAL_BYTES     (SC_CARD_RESP_PAYLOAD_BYTES + 2U)  /* +SW */

/* Mock scripting limits */
#define MOCK_MAX_SCRIPTS             (8U)
#define MOCK_MAX_RESP_BYTES        (255U)

/* Known P-256 public key (NIST FIPS 186-4 test vector) used as the
 * card's ephemeral key in mock-transport tests.
 * 64 bytes = X[32] || Y[32] (no 0x04 prefix). */
static const uint8_t K_CARD_EPHEMERAL_PUB[SC_EC_PUBKEY_BYTES] = {
    /* X */
    0x60U, 0xfeU, 0xd4U, 0xbaU, 0x25U, 0x5aU, 0x9dU, 0x31U,
    0xc9U, 0x61U, 0xebU, 0x74U, 0xc6U, 0x35U, 0x6dU, 0x68U,
    0xc0U, 0x49U, 0xb8U, 0x92U, 0x3bU, 0x61U, 0xfaU, 0x6cU,
    0xe6U, 0x69U, 0x62U, 0x2eU, 0x60U, 0xf2U, 0x9fU, 0xb6U,
    /* Y */
    0x79U, 0x03U, 0xfeU, 0x10U, 0x08U, 0xb8U, 0xbcU, 0x99U,
    0xa4U, 0x1aU, 0xe9U, 0xe9U, 0x56U, 0x28U, 0xbcU, 0x64U,
    0xf2U, 0xf1U, 0xb2U, 0x0cU, 0x2dU, 0x7eU, 0x9fU, 0x51U,
    0x77U, 0xa3U, 0xc2U, 0x94U, 0xd4U, 0x46U, 0x22U, 0x99U
};

/* Known Kenc / Kmac for the AES-CBC round-trip test (AES-256 key from
 * NIST SP 800-38A, extended to 32 bytes for the second key). */
static const uint8_t K_TEST_KENC[SC_AES_KEY_BYTES] = {
    0x60U, 0x3dU, 0xebU, 0x10U, 0x15U, 0xcaU, 0x71U, 0xbeU,
    0x2bU, 0x73U, 0xaeU, 0xf0U, 0x85U, 0x7dU, 0x77U, 0x81U,
    0x1fU, 0x35U, 0x2cU, 0x07U, 0x3bU, 0x61U, 0x08U, 0xd7U,
    0x2dU, 0x98U, 0x10U, 0xa3U, 0x09U, 0x14U, 0xdfU, 0xf4U
};
static const uint8_t K_TEST_KMAC[SC_AES_KEY_BYTES] = {
    0x00U, 0x01U, 0x02U, 0x03U, 0x04U, 0x05U, 0x06U, 0x07U,
    0x08U, 0x09U, 0x0aU, 0x0bU, 0x0cU, 0x0dU, 0x0eU, 0x0fU,
    0x10U, 0x11U, 0x12U, 0x13U, 0x14U, 0x15U, 0x16U, 0x17U,
    0x18U, 0x19U, 0x1aU, 0x1bU, 0x1cU, 0x1dU, 0x1eU, 0x1fU
};

/* Card response payload returned by the reflective mock (4 bytes + SW). */
static const uint8_t K_CARD_RESP_PLAINTEXT[SC_CARD_RESP_TOTAL_BYTES] = {
    0xdeU, 0xadU, 0xbeU, 0xefU, 0x90U, 0x00U
};

/******************************************************************
 * 2. MockLogger — no-op implementation
 ******************************************************************/

class MockLogger : public CW_Logger {
public:
    bool begin(unsigned long = 115200UL) override { return true; }
    void print(const __FlashStringHelper*) override {}
    void print(const char*) override {}
    void print(char) override {}
    void print(uint8_t, int = DEC) override {}
    void print(uint16_t, int = DEC) override {}
    void print(uint32_t, int = DEC) override {}
    void print(int, int = DEC) override {}
    void println() override {}
    void println(const __FlashStringHelper*) override {}
    void println(const char*) override {}
    void println(char) override {}
    void println(uint8_t, int = DEC) override {}
    void println(uint16_t, int = DEC) override {}
    void println(uint32_t, int = DEC) override {}
    void println(int, int = DEC) override {}
    ~MockLogger() override {}
};

/******************************************************************
 * 3. ScriptedMockNfcTransport — returns pre-loaded response buffers
 ******************************************************************/

struct MockScriptEntry {
    uint8_t data[MOCK_MAX_RESP_BYTES];
    uint8_t len;
    bool    succeed;
};

class ScriptedMockNfcTransport : public CW_NfcTransport {
public:
    MockScriptEntry scripts[MOCK_MAX_SCRIPTS];
    uint8_t         scriptCount;
    uint8_t         callIdx;

    void reset() {
        scriptCount = 0U;
        callIdx     = 0U;
        memset(scripts, 0, sizeof(scripts));
    }

    void addScript(const uint8_t* data, uint8_t len, bool succeed = true) {
        if (scriptCount < MOCK_MAX_SCRIPTS) {
            memcpy(scripts[scriptCount].data, data, static_cast<size_t>(len));
            scripts[scriptCount].len     = len;
            scripts[scriptCount].succeed = succeed;
            scriptCount++;
        }
    }

    bool begin() override { return true; }
    bool inListPassiveTarget() override { return true; }
    void resetReader() override {}
    bool printFirmwareVersion() override { return true; }

    bool sendAPDU(const uint8_t* apdu, uint8_t apduLen,
                  uint8_t* response, uint8_t& responseLen) override {
        bool result = false;
        (void)apdu;
        (void)apduLen;

        if (callIdx < scriptCount) {
            const MockScriptEntry& e = scripts[callIdx];
            callIdx++;
            if (e.succeed) {
                memcpy(response, e.data, static_cast<size_t>(e.len));
                responseLen = e.len;
                result = true;
            }
        }
        return result;
    }

    ~ScriptedMockNfcTransport() override {}
};

/******************************************************************
 * 4. ReflectiveMockNfcTransport — computes a valid encrypted response
 *    for the AES-CBC-MAC round-trip test.
 *
 *    Expected incoming APDU layout (from CW_SecureChannel::aesCbcEncrypt):
 *      header[4] | Lc[1] | MAC[16] | ciphertext[N]
 *
 *    The mock extracts the sent MAC, encrypts K_CARD_RESP_PLAINTEXT using
 *    the session Kenc with that MAC as IV (matching what aesCbcDecrypt
 *    expects), and wraps it in the response MAC.
 ******************************************************************/

