embarquech/cryptnox-sdk-esp32/components/secure_channel/test/test_cw_secure_channel.cpp
class ReflectiveMockNfcTransport : public CW_NfcTransport {
public:
    const CW_SecureSession* session;
    CW_CryptoProvider*      crypto;

    bool begin() override { return true; }
    bool inListPassiveTarget() override { return true; }
    void resetReader() override {}
    bool printFirmwareVersion() override { return true; }

    bool sendAPDU(const uint8_t* apdu, uint8_t apduLen,
                  uint8_t* response, uint8_t& responseLen) override {
        bool result = false;

        if ((apdu != NULL) &&
            (apduLen > static_cast<uint8_t>(SC_APDU_MAC_OFFSET + SC_APDU_MAC_BYTES))) {
            /* Step 1: extract sentMAC — used as IV when the channel decrypts the response */
            uint8_t sentMacIv[SC_AES_BLOCK_BYTES] = { 0U };
            memcpy(sentMacIv, apdu + SC_APDU_MAC_OFFSET, SC_AES_BLOCK_BYTES);

            /* Step 2: encrypt K_CARD_RESP_PLAINTEXT using Kenc, sentMAC as IV, bit-padding */
            uint8_t cipherResp[SC_AES_BLOCK_BYTES * 2U] = { 0U };
            uint8_t encIv[SC_AES_BLOCK_BYTES] = { 0U };
            memcpy(encIv, sentMacIv, SC_AES_BLOCK_BYTES);

            uint16_t cipherRespLen = crypto->aesCbcEncrypt(
                K_CARD_RESP_PLAINTEXT,
                static_cast<uint16_t>(sizeof(K_CARD_RESP_PLAINTEXT)),
                cipherResp,
                session->aesKey,
                static_cast<uint8_t>(sizeof(session->aesKey)),
                encIv,
                true);

            /* Step 3: build the response MAC input:
             *   [totalDataLen as 1st byte of a 16-byte zero block] || [cipherResp] */
            uint8_t totalDataLen = static_cast<uint8_t>(SC_AES_BLOCK_BYTES + cipherRespLen);
            uint8_t macInput[SC_AES_BLOCK_BYTES + SC_AES_BLOCK_BYTES * 2U] = { 0U };
            macInput[0U] = totalDataLen;
            memcpy(macInput + SC_AES_BLOCK_BYTES, cipherResp,
                   static_cast<size_t>(cipherRespLen));

            uint16_t macInputLen = static_cast<uint16_t>(SC_AES_BLOCK_BYTES) + cipherRespLen;

            uint8_t macZeroIv[SC_AES_BLOCK_BYTES] = { 0U };
            uint8_t macOut[SC_AES_BLOCK_BYTES + SC_AES_BLOCK_BYTES * 2U] = { 0U };
            uint16_t macOutLen = crypto->aesCbcEncrypt(
                macInput,
                macInputLen,
                macOut,
                session->macKey,
                static_cast<uint8_t>(sizeof(session->macKey)),
                macZeroIv,
                false);

            /* Step 4: responseMac = last 16 bytes of macOut */
            const uint8_t* responseMac =
                macOut + macOutLen - static_cast<uint16_t>(SC_AES_BLOCK_BYTES);

            /* Step 5: assemble response = responseMac[16] || cipherResp[N] || SW[2] */
            uint8_t totalRespLen = static_cast<uint8_t>(
                static_cast<uint16_t>(SC_AES_BLOCK_BYTES) + cipherRespLen + 2U);

            memcpy(response, responseMac, SC_AES_BLOCK_BYTES);
            memcpy(response + SC_AES_BLOCK_BYTES, cipherResp,
                   static_cast<size_t>(cipherRespLen));
            response[SC_AES_BLOCK_BYTES + cipherRespLen]      = 0x90U;
            response[SC_AES_BLOCK_BYTES + cipherRespLen + 1U] = 0x00U;
            responseLen = totalRespLen;
            result = true;
        }

        return result;
    }

    ~ReflectiveMockNfcTransport() override {}
};

/******************************************************************
 * 5. TestCryptoProvider — ESP32CryptoProvider with the WiFi/BT
 *    entropy-readiness gate removed.
 *
 *    ESP32CryptoProvider::random() returns false when neither WiFi
 *    nor BT is active, which would cause mutuallyAuthenticate() to
 *    abort during unit tests.  This subclass calls esp_fill_random()
 *    directly so tests run without a radio.
 ******************************************************************/

class TestCryptoProvider : public ESP32CryptoProvider {
public:
    bool random(uint8_t* dest, unsigned size) override {
        bool result = false;
        if ((dest != NULL) && (size > 0U)) {
            esp_fill_random(dest, static_cast<size_t>(size));
            result = true;
        }
        return result;
    }
    ~TestCryptoProvider() override {}
};

/******************************************************************
 * 6. Static instances shared across tests
 ******************************************************************/

static TestCryptoProvider         s_crypto;
static MockLogger                 s_logger;
static ScriptedMockNfcTransport   s_scriptedTransport;
static ReflectiveMockNfcTransport s_reflectiveTransport;

/******************************************************************
 * 6. checkStatusWord tests
 ******************************************************************/

TEST_CASE("checkStatusWord: SW 0x9000 returns true", "[secure_channel]")
{
    static const uint8_t resp[] = {
        0x01U, 0x02U, 0x03U, 0x04U, 0x90U, 0x00U
    };
    CW_SecureChannel channel(s_scriptedTransport, s_logger, s_crypto);

    bool ok = channel.checkStatusWord(resp, static_cast<uint8_t>(sizeof(resp)),
                                      0x90U, 0x00U);

    TEST_ASSERT_TRUE(ok);
}

TEST_CASE("checkStatusWord: SW mismatch returns false", "[secure_channel]")
{
    static const uint8_t resp[] = {
        0x01U, 0x02U, 0x6aU, 0x82U
    };
    CW_SecureChannel channel(s_scriptedTransport, s_logger, s_crypto);

    bool ok = channel.checkStatusWord(resp, static_cast<uint8_t>(sizeof(resp)),
                                      0x90U, 0x00U);

    TEST_ASSERT_FALSE(ok);
}

TEST_CASE("checkStatusWord: response shorter than 2 bytes returns false", "[secure_channel]")
{
    static const uint8_t resp[] = { 0x90U };
    CW_SecureChannel channel(s_scriptedTransport, s_logger, s_crypto);

    bool ok = channel.checkStatusWord(resp, static_cast<uint8_t>(sizeof(resp)),
                                      0x90U, 0x00U);

    TEST_ASSERT_FALSE(ok);
}

/******************************************************************
 * 7. extractCardEphemeralKey tests
 ******************************************************************/

TEST_CASE("extractCardEphemeralKey: extracts 64-byte key from synthetic certificate",
          "[secure_channel]")
{
    /* Build a 74-byte synthetic certificate:
     *   cert[0]    = 'C' marker
     *   cert[1..8] = nonce (arbitrary)
     *   cert[9]    = 0x04 (uncompressed prefix — dropped by the extractor)
     *   cert[10..41] = X coordinate (known pattern)
     *   cert[42..73] = Y coordinate (known pattern) */
    uint8_t cert[SC_CERT_TOTAL_BYTES] = { 0U };
    cert[0U] = 0x43U;  /* 'C' */
    for (uint8_t i = 0U; i < static_cast<uint8_t>(SC_CERT_NONCE_BYTES); i++) {
        cert[static_cast<size_t>(SC_CERT_MARKER_BYTES) + i] = static_cast<uint8_t>(i + 1U);
    }
    cert[SC_CERT_KEY_OFFSET] = 0x04U;  /* uncompressed prefix */
    for (uint8_t i = 1U; i < static_cast<uint8_t>(SC_CERT_KEY65_BYTES); i++) {
        cert[static_cast<size_t>(SC_CERT_KEY_OFFSET) + i] = static_cast<uint8_t>(0xA0U + i);
    }

    uint8_t pubKey[SC_EC_PUBKEY_BYTES]    = { 0U };
    uint8_t fullKey65[SC_CERT_KEY65_BYTES] = { 0U };

