embarquech/cryptnox-sdk-esp32/components/secure_channel/test/test_cw_secure_channel.cpp
    CW_SecureChannel channel(s_scriptedTransport, s_logger, s_crypto);
    bool ok = channel.extractCardEphemeralKey(cert, pubKey, fullKey65);

    TEST_ASSERT_TRUE(ok);

    /* fullKey65[0] must be the 0x04 prefix */
    TEST_ASSERT_EQUAL_HEX8(0x04U, fullKey65[0U]);

    /* pubKey = fullKey65[1..64] = cert[10..73] */
    TEST_ASSERT_EQUAL_HEX8_ARRAY(cert + SC_CERT_KEY_OFFSET + 1U, pubKey,
                                  SC_EC_PUBKEY_BYTES);
}

TEST_CASE("extractCardEphemeralKey: null cert pointer returns false", "[secure_channel]")
{
    uint8_t pubKey[SC_EC_PUBKEY_BYTES] = { 0U };

    CW_SecureChannel channel(s_scriptedTransport, s_logger, s_crypto);
    bool ok = channel.extractCardEphemeralKey(NULL, pubKey, NULL);

    TEST_ASSERT_FALSE(ok);
}

/******************************************************************
 * 8. Protocol-flow tests with ScriptedMockNfcTransport
 ******************************************************************/

TEST_CASE("selectApdu: succeeds when transport returns SW 0x9000", "[secure_channel]")
{
    uint8_t resp[SC_SELECT_RESP_BYTES] = { 0U };
    resp[SC_SELECT_RESP_BYTES - 2U] = 0x90U;
    resp[SC_SELECT_RESP_BYTES - 1U] = 0x00U;

    s_scriptedTransport.reset();
    s_scriptedTransport.addScript(resp, static_cast<uint8_t>(sizeof(resp)));

    CW_SecureChannel channel(s_scriptedTransport, s_logger, s_crypto);
    bool ok = channel.selectApdu();

    TEST_ASSERT_TRUE(ok);
}

TEST_CASE("selectApdu: fails when transport returns error SW", "[secure_channel]")
{
    uint8_t resp[SC_SELECT_RESP_BYTES] = { 0U };
    resp[SC_SELECT_RESP_BYTES - 2U] = 0x6aU;
    resp[SC_SELECT_RESP_BYTES - 1U] = 0x82U;

    s_scriptedTransport.reset();
    s_scriptedTransport.addScript(resp, static_cast<uint8_t>(sizeof(resp)));

    CW_SecureChannel channel(s_scriptedTransport, s_logger, s_crypto);
    bool ok = channel.selectApdu();

    TEST_ASSERT_FALSE(ok);
}

TEST_CASE("getCardCertificate: extracts 146 certificate bytes from mock response",
          "[secure_channel]")
{
    /* Build a 148-byte scripted response:
     *   bytes[0..145] = certificate data
     *   bytes[146..147] = SW 0x90 0x00 */
    uint8_t resp[SC_GET_CERT_RESP_BYTES] = { 0U };
    for (uint8_t i = 0U; i < static_cast<uint8_t>(SC_GET_CERT_RESP_BYTES - 2U); i++) {
        resp[i] = static_cast<uint8_t>(i + 1U);
    }
    resp[SC_GET_CERT_RESP_BYTES - 2U] = 0x90U;
    resp[SC_GET_CERT_RESP_BYTES - 1U] = 0x00U;

    s_scriptedTransport.reset();
    s_scriptedTransport.addScript(resp, static_cast<uint8_t>(sizeof(resp)));

    uint8_t certBuf[SC_GET_CERT_RESP_BYTES] = { 0U };
    uint8_t certLen = 0U;

    CW_SecureChannel channel(s_scriptedTransport, s_logger, s_crypto);
    bool ok = channel.getCardCertificate(certBuf, certLen);

    TEST_ASSERT_TRUE(ok);
    TEST_ASSERT_EQUAL_UINT8(static_cast<uint8_t>(SC_GET_CERT_RESP_BYTES - 2U), certLen);
    TEST_ASSERT_EQUAL_HEX8_ARRAY(resp, certBuf, certLen);
}

TEST_CASE("openSecureChannel: extracts 32-byte salt from mock response", "[secure_channel]")
{
    /* Build 34-byte scripted response: 32-byte salt + SW */
    uint8_t resp[SC_OPEN_SC_RESP_BYTES] = { 0U };
    for (uint8_t i = 0U; i < static_cast<uint8_t>(SC_SALT_BYTES); i++) {
        resp[i] = static_cast<uint8_t>(0xA0U + i);
    }
    resp[SC_OPEN_SC_RESP_BYTES - 2U] = 0x90U;
    resp[SC_OPEN_SC_RESP_BYTES - 1U] = 0x00U;

    s_scriptedTransport.reset();
    s_scriptedTransport.addScript(resp, static_cast<uint8_t>(sizeof(resp)));

    uint8_t salt[SC_SALT_BYTES]              = { 0U };
    uint8_t clientPub[SC_EC_PUBKEY_BYTES]    = { 0U };
    uint8_t clientPriv[SC_EC_COORD_BYTES]    = { 0U };
    const uECC_Curve_t* curve = uECC_secp256r1();

    CW_SecureChannel channel(s_scriptedTransport, s_logger, s_crypto);
    bool ok = channel.openSecureChannel(salt, clientPub, clientPriv, curve);

    TEST_ASSERT_TRUE(ok);

    /* Salt must match the first 32 bytes of the scripted response */
    TEST_ASSERT_EQUAL_HEX8_ARRAY(resp, salt, SC_SALT_BYTES);

    /* Client keypair must have been generated (non-zero) */
    uint8_t zeroPub[SC_EC_PUBKEY_BYTES] = { 0U };
    uint8_t zeroPriv[SC_EC_COORD_BYTES] = { 0U };
    TEST_ASSERT_NOT_EQUAL(0, memcmp(clientPub,  zeroPub,  SC_EC_PUBKEY_BYTES));
    TEST_ASSERT_NOT_EQUAL(0, memcmp(clientPriv, zeroPriv, SC_EC_COORD_BYTES));
}

TEST_CASE("mutuallyAuthenticate: sets session IV to first 16 bytes of mock response",
          "[secure_channel]")
{
    /* Scripted 66-byte response for MUTUALLY AUTHENTICATE:
     *   bytes[0..15]  = rolling IV (known pattern)
     *   bytes[16..63] = dummy encrypted data
     *   bytes[64..65] = SW 0x90 0x00 */
    uint8_t resp[SC_MUTUAL_AUTH_RESP_BYTES] = { 0U };
    for (uint8_t i = 0U; i < static_cast<uint8_t>(SC_IV_BYTES); i++) {
        resp[i] = static_cast<uint8_t>(0xC0U + i);
    }
    resp[SC_MUTUAL_AUTH_RESP_BYTES - 2U] = 0x90U;
    resp[SC_MUTUAL_AUTH_RESP_BYTES - 1U] = 0x00U;

    s_scriptedTransport.reset();
    s_scriptedTransport.addScript(resp, static_cast<uint8_t>(sizeof(resp)));

    /* Use the known P-256 public key as the card's ephemeral key.
     * Any valid point on secp256r1 works here — ECDH must not fail. */
    uint8_t cardEphemeralPub[SC_EC_PUBKEY_BYTES] = { 0U };
    memcpy(cardEphemeralPub, K_CARD_EPHEMERAL_PUB, SC_EC_PUBKEY_BYTES);

    uint8_t clientPub[SC_EC_PUBKEY_BYTES]  = { 0U };
    uint8_t clientPriv[SC_EC_COORD_BYTES]  = { 0U };
    uint8_t salt[SC_SALT_BYTES]            = { 0U };
    const uECC_Curve_t* curve              = uECC_secp256r1();

    bool keyOk = s_crypto.makeKey(clientPub, clientPriv, curve);
    TEST_ASSERT_TRUE(keyOk);

    CW_SecureSession session;
    CW_SecureChannel channel(s_scriptedTransport, s_logger, s_crypto);
    bool ok = channel.mutuallyAuthenticate(session, salt, clientPub, clientPriv,
                                           curve, cardEphemeralPub);

    TEST_ASSERT_TRUE(ok);

    /* Session IV must be the first 16 bytes of the scripted response */
    TEST_ASSERT_EQUAL_HEX8_ARRAY(resp, session.iv, SC_IV_BYTES);

    /* Session keys must be non-zero (ECDH + SHA-512 derivation ran) */
    uint8_t zeroKey[SC_AES_KEY_BYTES] = { 0U };
    TEST_ASSERT_NOT_EQUAL(0, memcmp(session.aesKey, zeroKey, SC_AES_KEY_BYTES));
    TEST_ASSERT_NOT_EQUAL(0, memcmp(session.macKey, zeroKey, SC_AES_KEY_BYTES));
}

/******************************************************************
 * 9. Key derivation correctness test
 *
 *    The secure channel derives Kenc and Kmac as:
 *      sha512( ecdh_secret || "Cryptnox Basic CommonPairingData" || salt )
 *    Kenc = output[0..31], Kmac = output[32..63].
 *
 *    This test verifies the derivation is consistent by computing it
 *    independently and comparing with what SHA-512 over the same input
 *    produces directly through the crypto provider.
 ******************************************************************/

TEST_CASE("key derivation: ECDH + SHA-512 split yields distinct Kenc and Kmac",
          "[secure_channel]")
{
    const uECC_Curve_t* curve = uECC_secp256r1();

    /* Generate two ephemeral keypairs */
    uint8_t pubA[SC_EC_PUBKEY_BYTES]  = { 0U };
    uint8_t privA[SC_EC_COORD_BYTES]  = { 0U };
    uint8_t pubB[SC_EC_PUBKEY_BYTES]  = { 0U };
    uint8_t privB[SC_EC_COORD_BYTES]  = { 0U };

