embarquech/cryptnox-sdk-esp32/components/secure_channel/test/test_cw_secure_channel.cpp
    bool okA = s_crypto.makeKey(pubA, privA, curve);
    bool okB = s_crypto.makeKey(pubB, privB, curve);
    TEST_ASSERT_TRUE(okA);
    TEST_ASSERT_TRUE(okB);

    /* ECDH: both sides must yield the same shared secret */
    uint8_t secretAB[SC_EC_COORD_BYTES] = { 0U };
    uint8_t secretBA[SC_EC_COORD_BYTES] = { 0U };
    bool ecdhAB = s_crypto.ecdh(pubB, privA, secretAB, curve);
    bool ecdhBA = s_crypto.ecdh(pubA, privB, secretBA, curve);
    TEST_ASSERT_TRUE(ecdhAB);
    TEST_ASSERT_TRUE(ecdhBA);
    TEST_ASSERT_EQUAL_HEX8_ARRAY(secretAB, secretBA, SC_EC_COORD_BYTES);

    /* Manually derive Kenc/Kmac with a known salt */
    static const uint8_t SALT[SC_SALT_BYTES] = {
        0x11U, 0x22U, 0x33U, 0x44U, 0x55U, 0x66U, 0x77U, 0x88U,
        0x99U, 0xaaU, 0xbbU, 0xccU, 0xddU, 0xeeU, 0xffU, 0x00U,
        0x01U, 0x02U, 0x03U, 0x04U, 0x05U, 0x06U, 0x07U, 0x08U,
        0x09U, 0x0aU, 0x0bU, 0x0cU, 0x0dU, 0x0eU, 0x0fU, 0x10U
    };

    uint8_t concat[SC_EC_COORD_BYTES + SC_PAIRING_DATA_BYTES + SC_SALT_BYTES] = { 0U };
    memcpy(concat, secretAB, SC_EC_COORD_BYTES);
    memcpy(concat + SC_EC_COORD_BYTES, SC_PAIRING_DATA, SC_PAIRING_DATA_BYTES);
    memcpy(concat + SC_EC_COORD_BYTES + SC_PAIRING_DATA_BYTES, SALT, SC_SALT_BYTES);

    uint8_t sha512Out[SC_SHA512_OUT_BYTES] = { 0U };
    s_crypto.sha512(concat, sizeof(concat), sha512Out);

    /* Kenc = sha512[0..31], Kmac = sha512[32..63] — they must differ */
    uint8_t* derivedKenc = sha512Out;
    uint8_t* derivedKmac = sha512Out + SC_AES_KEY_BYTES;

    TEST_ASSERT_NOT_EQUAL(0, memcmp(derivedKenc, derivedKmac, SC_AES_KEY_BYTES));

    /* Cross-check: running mutuallyAuthenticate with these inputs must set
     * the same Kenc/Kmac in the session (one scripted APDU response). */
    uint8_t mutualResp[SC_MUTUAL_AUTH_RESP_BYTES] = { 0U };
    mutualResp[SC_MUTUAL_AUTH_RESP_BYTES - 2U] = 0x90U;
    mutualResp[SC_MUTUAL_AUTH_RESP_BYTES - 1U] = 0x00U;

    s_scriptedTransport.reset();
    s_scriptedTransport.addScript(mutualResp,
                                   static_cast<uint8_t>(sizeof(mutualResp)));

    CW_SecureSession session;
    CW_SecureChannel channel(s_scriptedTransport, s_logger, s_crypto);

    /* publicB acts as the "card" ephemeral key; privA is the client key.
     * The ECDH inside mutuallyAuthenticate will compute secretAB. */
    bool ok = channel.mutuallyAuthenticate(session, SALT, pubA, privA, curve, pubB);
    TEST_ASSERT_TRUE(ok);

    TEST_ASSERT_EQUAL_HEX8_ARRAY(derivedKenc, session.aesKey, SC_AES_KEY_BYTES);
    TEST_ASSERT_EQUAL_HEX8_ARRAY(derivedKmac, session.macKey, SC_AES_KEY_BYTES);
}

/******************************************************************
 * 10. AES-CBC-MAC round-trip: aesCbcEncrypt + aesCbcDecrypt
 *
 *     Uses a manually set session (known Kenc/Kmac) and the
 *     ReflectiveMockNfcTransport which computes a valid card response.
 *     Verifies the decrypted payload matches K_CARD_RESP_PLAINTEXT[0..3].
 ******************************************************************/

TEST_CASE("aesCbcEncrypt/aesCbcDecrypt: round-trip via reflective mock returns card payload",
          "[secure_channel]")
{
    /* Set up a session with known keys and a zero IV */
    CW_SecureSession session;
    memcpy(session.aesKey, K_TEST_KENC, SC_AES_KEY_BYTES);
    memcpy(session.macKey, K_TEST_KMAC, SC_AES_KEY_BYTES);
    memset(session.iv, 0x00U, SC_IV_BYTES);

    /* Wire the reflective mock to this session */
    s_reflectiveTransport.session = &session;
    s_reflectiveTransport.crypto  = &s_crypto;

    CW_SecureChannel channel(s_reflectiveTransport, s_logger, s_crypto);

    /* Arbitrary plaintext command payload */
    static const uint8_t plaintext[]   = { 0xAAU, 0xBBU, 0xCCU };
    static const uint8_t apduHeader[]  = { 0x80U, 0x01U, 0x00U, 0x00U };

    uint8_t  decryptedOut[32U] = { 0U };
    uint16_t decryptedLen      = 0U;

    bool ok = channel.aesCbcEncrypt(
        session,
        apduHeader,
        static_cast<uint16_t>(sizeof(apduHeader)),
        plaintext,
        static_cast<uint16_t>(sizeof(plaintext)),
        decryptedOut,
        &decryptedLen);

    TEST_ASSERT_TRUE(ok);

    /* decryptedLen = card response payload without the two SW bytes */
    TEST_ASSERT_EQUAL_UINT16(static_cast<uint16_t>(SC_CARD_RESP_PAYLOAD_BYTES),
                              decryptedLen);

    /* Decrypted payload must match K_CARD_RESP_PLAINTEXT (excl. SW) */
    TEST_ASSERT_EQUAL_HEX8_ARRAY(K_CARD_RESP_PLAINTEXT, decryptedOut,
                                  SC_CARD_RESP_PAYLOAD_BYTES);
}
